app/views/dogs/show.html.erb

    <h2>Questions & Comments</h2>
    <% if @dog.comments.any? %>
---
SELECT  1 AS one FROM "comments" WHERE "comments"."dog_id" = ? LIMIT 1  [["dog_id", 4]]
SELECT "comments".* FROM "comments" WHERE "comments"."dog_id" = ?  ORDER BY created_at ASC  [["dog_id", 4]]