app/controllers/applicants_controller.rb

  def index
    @applicants = Applicant.all.order(created_at: :desc)
---
SELECT "applicants".* FROM "applicants"  ORDER BY created_at ASC, "applicants"."created_at" DESC

  def create
    @applicant = Applicant.new(applicant_params)
    if @applicant.save
---
INSERT INTO "applicants" ("first_name", "last_name", "dog", "phone", "email", "address", "city", "state", "zip", "dogs", "about", "kids", "cats", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @applicant = Applicant.find(params[:id])
    @applicant.destroy
---
SELECT  "applicants".* FROM "applicants" WHERE "applicants"."id" = ?  ORDER BY created_at ASC LIMIT 1  [["id", 2]]
DELETE FROM "applicants" WHERE "applicants"."id" = ?  [["id", 2]]