app/controllers/charges_controller.rb

  def create
    @donation = Donation.find(params[:donation_id])
    @email = Donation.find(params[:donation_id]).email
    @first_name = Donation.find(params[:donation_id]).first_name
    @last_name = Donation.find(params[:donation_id]).last_name
    @amount = Donation.find(params[:donation_id]).amount
    @subtotal = view_context.number_to_currency(@amount).to_s.split(//).join.gsub(".","").to_i

    customer = Stripe::Customer.create(
      email: @email,
      card: params[:stripeToken]
    )

    charge = Stripe::Charge.create(
      customer: customer.id,
      amount: @subtotal,
      description: "Payment submitted by #{@first_name} #{@last_name}",
      currency: 'usd'
    )
---
SELECT  "donations".* FROM "donations" WHERE "donations"."id" = ? LIMIT 1  [["id", 42]]
INSERT INTO "charges" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Brandon"], ["last_name", "Seroyer"], ["email", "brandonseroyer@gmail.com"], ["created_at", "2016-04-01 18:32:18.934498"], ["updated_at", "2016-04-01 18:32:18.934498"]]