app/controllers/comments_controller.rb

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT 1  [["id", 4]]
---
  def new
    @dog = Dog.find(params[:dog_id])

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "comments" ("content", "author", "dog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Hi, is Ava still available?"], ["author", "Brandon"], ["dog_id", 4], ["created_at", "2015-12-02 03:36:04.398031"], ["updated_at", "2015-12-02 03:36:04.398031"]]
---
  def create
    @dog = Dog.find(params[:dog_id])
    @comment = @dog.comments.new(comment_params)
    if verify_recaptcha
      @comment.save

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ?  ORDER BY created_at ASC LIMIT 1  [["id", 1]]
---
  def edit
    @dog = Dog.find(params[:dog_id])
    @comment = Comment.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ?  ORDER BY created_at ASC LIMIT 1  [["id", 1]]
UPDATE "comments" SET "comment" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["comment", "Is Sky good with cats?"], ["updated_at", "2016-04-13 22:09:50.467169"], ["id", 1]]
---
  def update
    @comment = Comment.find(params[:id])
    @comment.update(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ?  ORDER BY created_at ASC LIMIT 1  [["id", 5]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 5]]
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy