app/controllers/dogs_controller.rb

SELECT "dogs".* FROM "dogs"  ORDER BY "dogs"."created_at" DESC
---
  def index
    @dogs = Dog.all.order(created_at: :desc)

INSERT INTO "dogs" ("name", "sex", "age", "breed", "info", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @dog = Dog.new(dog_params)
    if @dog.save

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT 1  [["id", 4]]
---
  def show
    @dog = Dog.find(params[:id])

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT 1  [["id", 5]]
---
  def edit
    @dog = Dog.find(params[:id])

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT 1  [["id", 27]]
UPDATE "dogs" SET "image_file_size" = ?, "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["image_file_size", 31991], ["image_updated_at", "2016-04-02 19:45:12.192743"], ["image_file_name", "ava.jpg"], ["updated_at", "2016-04-02 19:45:12.437595"], ["id", 39]]
---
  def update
    @dog = Dog.find(params[:id])
    @dog.update(dog_params)

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 5]]
---
  def destroy
    @dog = Dog.find(params[:id])
    @dog.destroy