app/controllers/donations_controller.rb

SELECT "donations".* FROM "donations"  ORDER BY "donations"."created_at" DESC
---
  def index
    @donations = Donation.page(params[:page]).per(10)

INSERT INTO "donations" ("first_name", "last_name", "email", "amount", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @donation = Donation.new(donation_params)
    @donation = clean_dollars
    @donation = Donation.new(donation_params)
    if @donation.save

SELECT  "donations".* FROM "donations" WHERE "donations"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "donations" WHERE "donations"."id" = ?  [["id", 1]]
---
  def destroy
    @donation = Donation.find(params[:id])
    @donation.destroy