app/controllers/testimonials_controller.rb

  def index
    @testimonials = Testimonial.all.order(created_at: :desc)
---
SELECT "testimonials".* FROM "testimonials"  ORDER BY "testimonials"."created_at" DESC

  def create
    @testimonial = Testimonial.new(testimonial_params)
    if @testimonial.save
---
INSERT INTO "testimonials" ("name", "date", "story", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @testimonial = Testimonial.find(params[:id])
---
SELECT  "testimonials".* FROM "testimonials" WHERE "testimonials"."id" = ? LIMIT 1  [["id", 5]]

  def edit
    @testimonial = Testimonial.find(params[:id])
---
SELECT  "testimonials".* FROM "testimonials" WHERE "testimonials"."id" = ? LIMIT 1  [["id", 5]]

  def update
    @testimonial = Testimonial.find(params[:id])

    if @testimonial.update(testimonial_params)
---
SELECT  "testimonials".* FROM "testimonials" WHERE "testimonials"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "testimonials" SET "name" = ?, "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "testimonials"."id" = ?  [["name", "Bob"], ["image_file_name", "sky_(1).jpg"], ["image_file_size", 14857], ["image_updated_at", "2015-12-04 04:17:14.221423"], ["updated_at", "2015-12-04 04:17:15.105147"], ["id", 5]]

  def destroy
    @testimonial = Testimonial.find(params[:id])
    @testimonial.destroy
---
SELECT  "testimonials".* FROM "testimonials" WHERE "testimonials"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "testimonials" WHERE "testimonials"."id" = ?  [["id", 1]]